# PipingConnectionType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PipingConnectionType Property
ParameterTypeId Class See Also
---
"Connection Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PipingConnectionType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipingConnectionType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PipingConnectionType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace